"""2. По введенным пользователем координатам двух точек вывести
уравнение прямой вида y = kx + b, проходящей через эти точки."""

print('Введите координаты двух точек.')
x1 = float(input('Координата x1: '))
y1 = float(input('Координата y1: '))
x2 = float(input('Координата x2: '))
y2 = float(input('Координата y2: '))

div_x = x2 - x1
div_y = y2 - y1

if div_x == 0 and div_y == 0:
    print('Точки совпадают')
elif div_x == 0:
    print(f'Уравнение прямой: x = {x1}')
elif div_y == 0:
    print(f'Уравнение прямой: y = {y1}')
else:
    k = div_y / div_x
    b = y2 - k * x2
    sign = '+' if b > 0 else '-'
    print(f'Уравнение прямой: y = {k}x {sign} {abs(b)}')
    print('Дополнительнная проверка: ')
    print(f'По координатам первой точки: {y1 == (k*x1 + b)}')
    print(f'По координатам первой точки: {y2 == (k*x2 + b)}')
